pmo-dataset/variations/graphviz_with_ids/37.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Query the next shop"];
  "User_2" [label="Ask about quantity,\nprice and deadline"];
  "Service_1" [label="Create a list of the\nparts"];
  "Service_2" [label="Reorder the cheapest\npart"];
  "Service_3" [label="Reorder the part as\nfast as possible"];
  "Manual_1" [label="Receive first batch\nof parts"];
  "Manual_2" [label="Receive second batch\nof parts"];
  "Manual_3" [label="Receive third batch\nof parts"];
  "Manual_4" [label="Start/Continue\nbuilding"];
  "Manual_5" [label="Complain to the\nfriends"];
  "StartNoneEvent_1" [shape=circle, label="Contract project\nreceived"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Project completed"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="Terms acceptable?"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="More parts needed?"];
  "ExclusiveGateway_5" [shape=diamond, label="Any stock falls?"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="How much is the\nstock fall?"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="Contract fullfilled?"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ComplexGateway_1" [shape=diamond, label="First parts arrived"];

  "StartNoneEvent_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "User_1";
  "Service_1" -> "ExclusiveGateway_3";
  "User_1" -> "User_2";
  "User_2" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3" [label="No"];
  "ExclusiveGateway_2" -> "Service_1" [label="Yes"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "ExclusiveGateway_1" [label="Yes"];
  "ExclusiveGateway_4" -> "ParallelGateway_1" [label="No"];
  "ParallelGateway_1" -> "Manual_1";
  "ParallelGateway_1" -> "Manual_2";
  "ParallelGateway_1" -> "Manual_3";
  "Manual_1" -> "ComplexGateway_1";
  "Manual_2" -> "ComplexGateway_1";
  "Manual_3" -> "ComplexGateway_1";
  "ComplexGateway_1" -> "Manual_4";
  "Manual_4" -> "ExclusiveGateway_5";
  "ExclusiveGateway_5" -> "ExclusiveGateway_7" [label="Yes"];
  "Service_3" -> "ExclusiveGateway_8";
  "Service_2" -> "ExclusiveGateway_8";
  "Manual_5" -> "ExclusiveGateway_8";
  "ExclusiveGateway_8" -> "ExclusiveGateway_6";
  "ExclusiveGateway_5" -> "ExclusiveGateway_6" [label="No"];
  "ExclusiveGateway_7" -> "Service_2" [label="Below 5"];
  "ExclusiveGateway_7" -> "Service_3" [label="Below 3"];
  "ExclusiveGateway_7" -> "Manual_5" [label="Zero"];
  "ExclusiveGateway_6" -> "ExclusiveGateway_9";
  "ExclusiveGateway_9" -> "Manual_4" [label="No"];
  "ExclusiveGateway_9" -> "EndNoneEvent_1" [label="Yes"];
}
